examples/dfHighSpeedFoam/twoD_RiemannProblem/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme          HLLC;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
	default         Gauss linear;
}

divSchemes
{
    default         		none;
	div(tauMC)				Gauss linear;
	div(hDiffCorrFlux)    	Gauss cubic;
	div(phi,Yi_h)			Gauss vanLeer;
}

laplacianSchemes
{
	default			Gauss linear uncorrected;	
}

interpolationSchemes
{
    default				linear;
	reconstruct(rho)	Minmod;
	reconstruct(U)		MinmodV;
	reconstruct(T)		Minmod;
	reconstruct(Yi)		Minmod;
    reconstruct(p)		Minmod;
    reconstruct(c)		Minmod;
}

snGradSchemes
{
	default				uncorrected;
}


// ************************************************************************* //
